<?php
$regions = array(
    "Московская область" => [
        "Москва",
        "Балашиха",
        "Домодедово",
        "Дмитров"
    ],
    "Ленинградская область" => [
        "Санкт-Петербург",
        "Мурино",
        "Гатчина",
        "Сосновый Бор"
    ],
    "Рязанская область" => [
        "Рязань",
        "Касимов",
        "Скопин",
        "Сасово"
    ]
);

foreach ($regions as $region => $cities) {
    echo "<br>" . $region . ":<br>" . implode(", ", $cities) . ".<br><br>";
}
?>